/**
 * 树---非顺序数据结构，它对于存储需要快速查找的数据非常有用。
 *      是一种分层的抽象模型， 生活中的例子是家谱，或是公司的组织架构。
 *
 * 相关术语：
 *      一个树包含一系列存在父子关系的节点。每个节点都有一个父节点（除了顶部的第一个节点）
 * 以及零个或多个子节点。
 *      位于树顶部的节点叫作根节点，它没有父节点，树中的每个元素都叫作节点，节点分为内部节点
 * 和外部节点。至少有一个子节点的节点称为内部节点。 没有子元素的节点称为外部节点和叶节点。
 *      一个节点可以有祖先和后代。一个节点（除了根节点）的祖先包含父节点、祖父节点、曾祖父
 * 节点等。一个节点的后代包括子节点、孙子节点、曾孙节点等。
 *      有关树的另一个术语是子树。子树由节点和它的后代构成，
 *      节点的一个属性是深度，节点的深度取决于它的祖先节点的数量。
 *      书的高度取决于所欲节点深度的最大值。一棵树也可以被分解成层级。根节点在第0层，它的
 * 子节点在第1层，以此类推。
 *
 *
 *
 * */



















